INSERT INTO "Employee" (first_name, last_name, date_of_birth, gender, phone_number, email)
VALUES
    ('Иван', 'Иванов', '1990-05-15', 'M', '123456789', 'ivan.ivanov@email.com'),
    ('Елена', 'Петрова', '1985-08-22', 'F', '987654321', 'elena.petrova@email.com'),
    ('Александр', 'Смирнов', '1982-11-10', 'M', '555555555', 'alex.smirnov@email.com'),
    ('Марина', 'Козлова', '1988-07-20', 'F', '111223344', 'marina.kozlova@email.com'),
    ('Анна', 'Попова', '1993-09-18', 'F', '555444333', 'anna.popova@email.com'),
    ('Павел', 'Кузнецов', '1987-12-05', 'M', '666777888', 'pavel.kuznetsov@email.com'),
    ('Екатерина', 'Сидорова', '1991-04-30', 'F', '333222111', 'ekaterina.sidorova@email.com'),
    ('Алексей', 'Никитин', '1998-02-15', 'M', '999000111', 'alexey.nikitin@email.com'),
    ('Ольга', 'Белякова', '1984-11-22', 'F', '111000222', 'olga.belyakova@email.com'),
    ('Игорь', 'Макаров', '1980-06-10', 'M', '444333222', 'igor.makarov@email.com'),
    ('Маргарита', 'Лебедева', '1990-08-03', 'F', '888999000', 'margarita.lebedeva@email.com'),
    ('Сергей', 'Григорьев', '1986-01-25', 'M', '222333444', 'sergey.grigoriev@email.com'),
    ('Анастасия', 'Королева', '1995-05-12', 'F', '777666555', 'anastasia.koroleva@email.com'),
    ('Денис', 'Борисов', '1989-07-08', 'M', '555666777', 'denis.borisov@email.com');

INSERT INTO "Department" (description, head_id)
VALUES
    ('Отдел разработки', 1),
    ('Отдел маркетинга', 2),
    ('Отдел тестирования', 3),
    ('Отдел продаж', 4);

UPDATE "Employee"
SET department_id = CASE id
                    WHEN 1 THEN 1
                    WHEN 2 THEN 2
                    WHEN 3 THEN 3
                    WHEN 4 THEN 4
                    WHEN 5 THEN 1
                    WHEN 6 THEN 2
                    WHEN 7 THEN 3
                    WHEN 8 THEN 4
                    WHEN 9 THEN 2
                    WHEN 10 THEN 3
                    WHEN 11 THEN 4
                    WHEN 12 THEN 2
                    WHEN 13 THEN 3
                    WHEN 14 THEN 1
                    END
WHERE id IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14);

INSERT INTO "Education" (description, start_date, end_date, employee_id)
VALUES
    ('Высшее образование', '2008-09-01', '2013-06-30', 1),
    ('Дополнительные курсы', '2010-03-15', '2011-05-20', 2),
    ('Курсы по программированию', '2014-02-01', '2014-06-30', 3),
    ('Академия маркетинга', '2016-09-10', '2017-05-15', 4),
    ('Специализированные курсы', '2015-03-01', '2015-07-31', 5),
    ('Академия бизнеса', '2013-09-10', '2014-05-15', 7),
    ('Курсы по качеству', '2016-06-20', '2017-01-25', 9),
    ('Интенсив по программированию', '2019-04-15', '2019-09-30', 11),
    ('Маркетинговые тренинги', '2012-08-01', '2012-12-31', 13);

INSERT INTO "PerformanceEvaluation" (evaluation_date, rating, comment, employee_id)
VALUES
    ('2022-01-15', 4, 'Хорошая работа', 1),
    ('2022-02-20', 5, 'Отличные результаты', 2),
    ('2022-03-25', 3, 'Требуется улучшение', 3),
    ('2022-04-30', 4, 'Хорошие показатели', 4),
    ('2022-06-15', 4, 'Отличные результаты', 5),
    ('2022-07-20', 3, 'Требуется дополнительное обучение', 7),
    ('2022-08-30', 5, 'Превосходная работа', 9),
    ('2022-09-25', 4, 'Хорошая эффективность', 11),
    ('2022-10-10', 5, 'Выдающиеся достижения', 13);

INSERT INTO "Vacation" (reason, start_date, end_date, employee_id)
VALUES
    ('Отпуск по болезни', '2022-07-01', '2022-07-15', 1),
    ('Ежегодный отпуск', '2022-08-10', '2022-08-25', 2),
    ('Отпуск семейный', '2022-11-01', '2022-11-15', 3),
    ('Отпуск без сохранения зарплаты', '2023-02-10', '2023-02-25', 8),
    ('Плановый отпуск', '2023-03-20', '2023-04-05', 10),
    ('Отпуск по личным обстоятельствам', '2023-06-10', '2023-06-25', 14);

INSERT INTO "WorkContract" (start_date, end_date, job_title, salary, employee_id)
VALUES
    ('2021-05-01', '2023-04-30', 'Разработчик', 80000, 1),
    ('2020-10-15', '2022-10-14', 'Маркетолог', 70000, 2),
    ('2021-08-01', '2023-07-31', 'Тестировщик', 75000, 3),
    ('2020-12-01', '2022-11-30', 'Продавец', 70000, 4),
    ('2022-01-01', '2024-01-01', 'Специалист по поддержке', 70000, 5),
    ('2022-07-01', '2023-07-01', 'Специалист по поддержке', 72000, 6),
    ('2022-02-15', '2023-02-15', 'Менеджер по закупкам', 75000, 7),
    ('2022-08-15', '2023-08-15', 'Менеджер по закупкам', 78000, 8),
    ('2022-03-20', '2023-09-20', 'Специалист по качеству', 80000, 9),
    ('2022-10-01', '2023-10-01', 'Специалист по качеству', 82000, 10),
    ('2022-04-25', '2024-04-25', 'Ведущий разработчик', 90000, 11),
    ('2023-01-01', '2024-01-01', 'Ведущий разработчик', 92000, 12),
    ('2022-05-30', '2023-05-30', 'Маркетолог', 85000, 13),
    ('2023-04-01', '2024-04-01', 'Маркетолог', 87000, 14);
